// 1.   Напишите функцию, которая принимает два аргумента и возвращает все числа, которые делятся на данный делитель.
//      Первый аргумент - это массив чисел, а второй - делитель.


// const arr = [1,2,3,4,5,6,7,8,9,10,12,13,14,15,16,17,18,19,20];
//
// const divisibleBy = (numbers, divisor) => {
//     let result = numbers.filter(item => item % divisor === 0);
//     return result;
// }
//
// console.log(divisibleBy(arr,3));


// ---------------------------------------------------------------------------------------------------------------------


// 2. Создание массива значений Фаренгейта из массива значений Цельсия:


// let celsius = [-15, -5, 0, 10, 16, 20, 24, 32];
//
// const fahrenheit = celsius.map(item => item * 1.8 + 32);
//
// console.log(fahrenheit);


// ---------------------------------------------------------------------------------------------------------------------


// 3. Дана некоторая строка: 'abcde abcde abcde'. Замените в ней первый символ каждого слова на '!':

// let str = 'abcde abcde abcde';
//
// const result = str.split('').map(item=> item === 'a' ? '!' : item).join('');
// console.log(result);


// ---------------------------------------------------------------------------------------------------------------------


// 4. Дан массив с числами: [1, 2, 3, 3, 4, 5]. Проверьте, что в этом массиве есть два одинаковых элемента подряд.

// const array = [1, 2, 3, 3, 4, 5];
//
// const result = array.find((item,index) => array.indexOf(item) !== index) ? 'Совпадение найдено' : 'Совпадение не найдено';
// console.log(result);



// ---------------------------------------------------------------------------------------------------------------------

// 5.

// const dna = ('t,a,a,c,g,t,t');
//
// let DNAStrand = (input) => {
//     let output = input
//         .toUpperCase()
//         .split('')
//         .map(item => item === 'A' ? 'T' : item === 'T' ? 'A' : item === 'C' ? 'G' : item === 'G' ? 'C' : item)
//         .join('');
//     return output;
// }
//
// console.log(DNAStrand(dna));